<?php
	declare(strict_types=1);

	const causes_list = [
		[
			"title" => "Победитель международной олимпиады",
			"code" => "Aa1",
			"kind" => "Олимпиадное движение",
			"price" => 10000
		],[
			"title" => "Призер международной олимпиады",
			"code" => "Aa2",
			"kind" => "Олимпиадное движение",
			"price" => 8000
		],[
			"title" => "Участник международной олимпиады",
			"code" => "Aa3",
			"kind" => "Олимпиадное движение",
			"price" => 6000
		],[
			"title" => "Победитель Всероссийской олимпиады",
			"code" => "Aa4",
			"kind" => "Олимпиадное движение",
			"price" => 5000
		],[
			"title" => "Призер Всероссийской олимпиады",
			"code" => "Aa5",
			"kind" => "Олимпиадное движение",
			"price" => 3000
		],[
			"title" => "Участник Всероссийской олимпиады",
			"code" => "Aa6",
			"kind" => "Олимпиадное движение",
			"price" => 1500
		],[
			"title" => "Победитель республиканской олимпиады",
			"code" => "Aa7",
			"kind" => "Олимпиадное движение",
			"price" => 1000
		],[
			"title" => "Призер республиканской олимпиады",
			"code" => "Aa8",
			"kind" => "Олимпиадное движение",
			"price" => 700
		],[
			"title" => "Участник республиканской олимпиады",
			"code" => "Aa9",
			"kind" => "Олимпиадное движение",
			"price" => 500
		],[
			"title" => "Победитель муниципальной олимпиады",
			"code" => "Aa10",
			"kind" => "Олимпиадное движение",
			"price" => 400
		],[
			"title" => "Призер муниципальной олимпиады",
			"code" => "Aa11",
			"kind" => "Олимпиадное движение",
			"price" => 300
		],[
			"title" => "Участник муниципальной олимпиады",
			"code" => "Aa12",
			"kind" => "Олимпиадное движение",
			"price" => 100
		],[
			"title" => "Победитель школьной олимпиады",
			"code" => "Aa13",
			"kind" => "Олимпиадное движение",
			"price" => 50
		],[
			"title" => "Призер школьной олимпиады",
			"code" => "Aa14",
			"kind" => "Олимпиадное движение",
			"price" => 30
		],[
			"title" => "Участник школьной олимпиады",
			"code" => "Aa15",
			"kind" => "Олимпиадное движение",
			"price" => 10
		],[
			"title" => "Ведение дневника олимпиадника",
			"code" => "Aa16",
			"kind" => "Олимпиадное движение",
			"price" => 10
		],[
			"title" => "Победитель Перечневой олимпиады (заключительный этап)",
			"code" => "Aa17",
			"kind" => "Олимпиадное движение",
			"price" => 1000
		],[
			"title" => "Призер Перечневой олимпиады (заключительный этап)",
			"code" => "Aa18",
			"kind" => "Олимпиадное движение",
			"price" => 700
		],[
			"title" => "Победитель Межрегиональной олимпиады КФУ",
			"code" => "Aa19",
			"kind" => "Олимпиадное движение",
			"price" => 400
		],[
			"title" => "Призер Межрегиональной олимпиады КФУ",
			"code" => "Aa20",
			"kind" => "Олимпиадное движение",
			"price" => 300
		],[
			"title" => "Победитель международных проектных конкурсов",
			"code" => "Ab1",
			"kind" => "Проектная деятельность",
			"price" => 10000
		],[
			"title" => "Призер международных проектных конкурсов",
			"code" => "Ab2",
			"kind" => "Проектная деятельность",
			"price" => 8000
		],[
			"title" => "Участник международных проектных конкурсов",
			"code" => "Ab3",
			"kind" => "Проектная деятельность",
			"price" => 500
		],[
			"title" => "Победитель Всероссийских проектных конкурсов",
			"code" => "Ab4",
			"kind" => "Проектная деятельность",
			"price" => 5000
		],[
			"title" => "Призер Всероссийских проектных конкурсов",
			"code" => "Ab5",
			"kind" => "Проектная деятельность",
			"price" => 3000
		],[
			"title" => "Участник Всероссийских проектных конкурсов",
			"code" => "Ab6",
			"kind" => "Проектная деятельность",
			"price" => 300
		],[
			"title" => "Победитель республиканских проектных конкурсов",
			"code" => "Ab7",
			"kind" => "Проектная деятельность",
			"price" => 1000
		],[
			"title" => "Призер республиканских проектных конкурсов",
			"code" => "Ab8",
			"kind" => "Проектная деятельность",
			"price" => 700
		],[
			"title" => "Участник республиканских проектных конкурсов",
			"code" => "Ab9",
			"kind" => "Проектная деятельность",
			"price" => 200
		],[
			"title" => "Победитель муниципальных проектных конкурсов",
			"code" => "Ab10",
			"kind" => "Проектная деятельность",
			"price" => 400
		],[
			"title" => "Призер муниципальных проектных конкурсов",
			"code" => "Ab11",
			"kind" => "Проектная деятельность",
			"price" => 300
		],[
			"title" => "Участник муниципальных проектных конкурсов",
			"code" => "Ab12",
			"kind" => "Проектная деятельность",
			"price" => 70
		],[
			"title" => "Победитель школьных проектных конкурсов",
			"code" => "Ab13",
			"kind" => "Проектная деятельность",
			"price" => 50
		],[
			"title" => "Призер школьных проектных конкурсов",
			"code" => "Ab14",
			"kind" => "Проектная деятельность",
			"price" => 30
		],[
			"title" => "Участник школьных проектных конкурсов",
			"code" => "Ab15",
			"kind" => "Проектная деятельность",
			"price" => 10
		],[
			"title" => "Апробация и развитие проекта",
			"code" => "Ab16",
			"kind" => "Проектная деятельность",
			"price" => 100
		],[
			"title" => "Средний балл аттестата \"5,0\" за четверть",
			"code" => "Ac1",
			"kind" => "Успеваемость",
			"price" => 300
		],[
			"title" => "Средний балл аттестата \"4,5\" - \"4,99\" за четверть",
			"code" => "Ac2",
			"kind" => "Успеваемость",
			"price" => 100
		],[
			"title" => "Средний балл аттестата \"4,0\" - \"4,49\" за четверть",
			"code" => "Ac3",
			"kind" => "Успеваемость",
			"price" => 20
		],[
			"title" => "Высокие результаты тестирования (90%-100%)",
			"code" => "Ac5",
			"kind" => "Успеваемость",
			"price" => 150
		],[
			"title" => "Средние результаты тестирования (75%-89%)",
			"code" => "Ac6",
			"kind" => "Успеваемость",
			"price" => 100
		],[
			"title" => "Директорские контрольные работы на оценку \"5\"",
			"code" => "Ac7",
			"kind" => "Успеваемость",
			"price" => 150
		],[
			"title" => "Директорские контрольные работы на оценку \"4\"",
			"code" => "Ac8",
			"kind" => "Успеваемость",
			"price" => 50
		],[
			"title" => "Помощь в организации мероприятия",
			"code" => "Ad1",
			"kind" => "Культурно-масссовые мероприятия",
			"price" => 70
		],[
			"title" => "Активное участие в мероприятии",
			"code" => "Ad2",
			"kind" => "Культурно-масссовые мероприятия",
			"price" => 70
		],[
			"title" => "Участие в литературных мероприятиях",
			"code" => "Ad3",
			"kind" => "Культурно-масссовые мероприятия",
			"price" => 70
		],[
			"title" => "Участие в районных соревнованиях",
			"code" => "Ae1",
			"kind" => "Спортивные мероприятия",
			"price" => 100
		],[
			"title" => "Участие в товарищеских играх",
			"code" => "Ae2",
			"kind" => "Спортивные мероприятия",
			"price" => 50
		],[
			"title" => "Посещение кружков",
			"code" => "Af1",
			"kind" => "Внеурочная деятельность",
			"price" => 20
		],[
			"title" => "Посещение библиотеки",
			"code" => "Af2",
			"kind" => "Внеурочная деятельность",
			"price" => 5
		],[
			"title" => "Участие в органах самоуправления лицея",
			"code" => "Ag1",
			"kind" => "Деятельность класса",
			"price" => 20
		],[
			"title" => "Участие в органах самоуправления класса",
			"code" => "Ag2",
			"kind" => "Деятельность класса",
			"price" => 10
		],[
			"title" => "Дежурство",
			"code" => "Ag5",
			"kind" => "Деятельность класса",
			"price" => 5
		],[
			"title" => "Порядок в комнате на оценку \"хорошо\"",
			"code" => "Ah1",
			"kind" => "Интернат",
			"price" => 100
		],[
			"title" => "Употребление жевательной резинки ",
			"code" => "Ba1",
			"kind" => "Нарушение дисциплины",
			"price" => -5
		],[
			"title" => "Плевание ",
			"code" => "Ba2",
			"kind" => "Нарушение дисциплины",
			"price" => -10
		],[
			"title" => "Нецелевое использование интернета ",
			"code" => "Ba3",
			"kind" => "Нарушение дисциплины",
			"price" => -10
		],[
			"title" => "Нарушение правил в столовой",
			"code" => "Ba4",
			"kind" => "Нарушение дисциплины",
			"price" => -30
		],[
			"title" => "Занятие посторонними делами в учебное время",
			"code" => "Ba5",
			"kind" => "Нарушение дисциплины",
			"price" => -30
		],[
			"title" => "Бег по школе, в кабинете, в столовой, в интернате",
			"code" => "Ba6",
			"kind" => "Нарушение дисциплины",
			"price" => -30
		],[
			"title" => "Нарушение правил библиотеки",
			"code" => "Ba7",
			"kind" => "Нарушение дисциплины",
			"price" => -5
		],[
			"title" => "Нецензурная лексика",
			"code" => "Ba8",
			"kind" => "Нарушение дисциплины",
			"price" => -10
		],[
			"title" => "Нарушение правил пользования телефоном, ноутбуком",
			"code" => "Ba9",
			"kind" => "Нарушение дисциплины",
			"price" => -50
		],[
			"title" => "Непристойные надписи или рисунки",
			"code" => "Ba10",
			"kind" => "Нарушение дисциплины",
			"price" => -20
		],[
			"title" => "Покидание класса/урока, дополнительного занятия, секции, мероприятия без разрешения",
			"code" => "Ba11",
			"kind" => "Нарушение дисциплины",
			"price" => -20
		],[
			"title" => "Нарушения порядка на линейке",
			"code" => "Ba12",
			"kind" => "Нарушение дисциплины",
			"price" => -15
		],[
			"title" => "Несоблюдение чистоты в школе",
			"code" => "Ba13",
			"kind" => "Нарушение дисциплины",
			"price" => -10
		],[
			"title" => "Нарушение правил в интернате",
			"code" => "Ba14",
			"kind" => "Нарушение дисциплины",
			"price" => -30
		],[
			"title" => "Намеренное непосещение линейки, прогул уроков или занятий, мероприятий",
			"code" => "Ba15",
			"kind" => "Нарушение дисциплины",
			"price" => -30
		],[
			"title" => "Неподобающее поведение во время уроков, мероприятия, поездок, экскурсии",
			"code" => "Ba16",
			"kind" => "Нарушение дисциплины",
			"price" => -30
		],[
			"title" => "Нарушение общепринятых норм поведения",
			"code" => "Ba17",
			"kind" => "Нарушение дисциплины",
			"price" => -10
		],[
			"title" => "Брань, угрозы, издевательства над другими учениками, ссоры",
			"code" => "Ba18",
			"kind" => "Нарушение дисциплины",
			"price" => -100
		],[
			"title" => "Несоблюдение чистоты в интернате",
			"code" => "Ba19",
			"kind" => "Нарушение дисциплины",
			"price" => -10
		],[
			"title" => "Подстрекательство",
			"code" => "Ba20",
			"kind" => "Нарушение дисциплины",
			"price" => -50
		],[
			"title" => "Нарушение правил ТБ",
			"code" => "Ba21",
			"kind" => "Нарушение дисциплины",
			"price" => -50
		],[
			"title" => "Порча школьного имущества, имущества в интернате",
			"code" => "Ba22",
			"kind" => "Нарушение дисциплины",
			"price" => -30
		],[
			"title" => "Пререкание с учителем, воспитателем или персоналом",
			"code" => "Ba23",
			"kind" => "Нарушение дисциплины",
			"price" => -50
		],[
			"title" => "Нарушение правил сетевого этикета",
			"code" => "Ba24",
			"kind" => "Нарушение дисциплины",
			"price" => -15
		],[
			"title" => "Ложь, сообщение недостоверной информации, клевета",
			"code" => "Ba25",
			"kind" => "Нарушение дисциплины",
			"price" => -15
		],[
			"title" => "Нарушение правил допустимых к хранению продуктов питания в интернате",
			"code" => "Ba26",
			"kind" => "Нарушение дисциплины",
			"price" => -15
		],[
			"title" => "Азартные игры",
			"code" => "Ba27",
			"kind" => "Нарушение дисциплины",
			"price" => -50
		],[
			"title" => "Неподготовленность к уроку",
			"code" => "Bb1",
			"kind" => "Учебные наказания",
			"price" => -10
		],[
			"title" => "Низкие результаты тестирования (ниже 49%)",
			"code" => "Bb2",
			"kind" => "Учебные наказания",
			"price" => -15
		],[
			"title" => "Директорские контрольные работы («2»)",
			"code" => "Bb3",
			"kind" => "Учебные наказания",
			"price" => -15
		],[
			"title" => "Занятость посторонними делами во время урока, самоподготовки",
			"code" => "Bb4",
			"kind" => "Учебные наказания",
			"price" => -7
		],[
			"title" => "Списывание",
			"code" => "Bb5",
			"kind" => "Учебные наказания",
			"price" => -15
		],[
			"title" => "Опоздание на занятия, линейку или самоподготовку",
			"code" => "Bb6",
			"kind" => "Учебные наказания",
			"price" => -10
		],[
			"title" => "Прогул занятий и самоподготовки",
			"code" => "Bb7",
			"kind" => "Учебные наказания",
			"price" => -20
		],[
			"title" => "Отсутствие значка лицеиста",
			"code" => "Bc1",
			"kind" => "Нарушение правил дресс-кода",
			"price" => -5
		],[
			"title" => "Грязная, мятая, потрепанная одежда",
			"code" => "Bc2",
			"kind" => "Нарушение правил дресс-кода",
			"price" => -5
		],[
			"title" => "Серьги (у мальчиков)",
			"code" => "Bc3",
			"kind" => "Нарушение правил дресс-кода",
			"price" => -5
		],[
			"title" => "Браслеты, цепи, кольца (в большом количестве)",
			"code" => "Bc4",
			"kind" => "Нарушение правил дресс-кода",
			"price" => -7
		],[
			"title" => "Нарушение правил школьной формы",
			"code" => "Bc5",
			"kind" => "Нарушение правил дресс-кода",
			"price" => -10
		],[
			"title" => "Хождение в шортах, майках, тапочках по территории лицея",
			"code" => "Bc6",
			"kind" => "Нарушение правил дресс-кода",
			"price" => -10
		],[
			"title" => "Грязные волосы, длинные ногти ",
			"code" => "Bc7",
			"kind" => "Нарушение правил дресс-кода",
			"price" => -10
		],[
			"title" => "Борода и щетина",
			"code" => "Bc8",
			"kind" => "Нарушение правил дресс-кода",
			"price" => -10
		],[
			"title" => "Явка без школьной формы ",
			"code" => "Bc9",
			"kind" => "Нарушение правил дресс-кода",
			"price" => -15
		],[
			"title" => "Одежда с изображением наркотиков, алкоголя, богохульства, порочащих намеков, нецензурных надписей, фото лидеров разных организаций и др.",
			"code" => "Bc10",
			"kind" => "Нарушение правил дресс-кода",
			"price" => -15
		],[
			"title" => "Неподобающая стрижка, окраска волос, пирсинг, тату",
			"code" => "Bc11",
			"kind" => "Нарушение правил дресс-кода",
			"price" => -20
		],[
			"title" => "Причинение вреда другим лицам случайное (по неосторожности)",
			"code" => "Bd1",
			"kind" => "Правонарушения",
			"price" => -15
		],[
			"title" => "Месть",
			"code" => "Bd2",
			"kind" => "Правонарушения",
			"price" => -20
		],[
			"title" => "Драка ",
			"code" => "Bd3",
			"kind" => "Правонарушения",
			"price" => -200
		],[
			"title" => "Угрозы, запугивания",
			"code" => "Bd4",
			"kind" => "Правонарушения",
			"price" => -100
		],[
			"title" => "Причинение вреда другим лицам (намеренное)",
			"code" => "Bd5",
			"kind" => "Правонарушения",
			"price" => -300
		],[
			"title" => "Устное выражение расизма, богохульства, нацизма и др.",
			"code" => "Bd6",
			"kind" => "Правонарушения",
			"price" => -100
		],[
			"title" => "Подделка документов, подлог",
			"code" => "Bd7",
			"kind" => "Правонарушения",
			"price" => -70
		],[
			"title" => "Публичные оскорбления других лиц: устно, в социальных сетях и др.",
			"code" => "Bd8",
			"kind" => "Правонарушения",
			"price" => -100
		]
	]
?>
